#coding: utf-8
#Задача 1
x = int(input("Введите x = "))
y = 7*x+5
print("Ответ y =", y)
#Задача 2
a = int(input("Введите a = "))
b = a*a*a*a
print("Ответ b =", b)
#Задача 3
Пи = 3.14
r = int(input("Введите r = "))
C = 2*Пи*r
print("Ответ C =", C)
#Задача 4
Пи = 3.14
d = int(input("Введите d = "))
S = Пи*d*d/4
print("Ответ S =", S)
#Задача 5
a = int(input("Введите a = "))
b = int(input("Введите b = "))
a1 = a
b1 = b1
c*c1 = a*a1+b*b1
c1 = c
c2 = c*c1*0.5
print("Ответ c2 =", c2)